src/Catalogs/Публикации/Публикации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Публикации</name>
  <attributes>
    <name>УдалитьЛогин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьТелоОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветДляСравнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПеренаправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаЭксплуатации</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадкаДляВосстановления</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипЭлементаПлощадки/ТипЭлементаПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЭлементаПлощадки</name>
  <enumValues>
    <name>Площадка</name>
  </enumValues>
  <enumValues>
    <name>ГруппаОборудования</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКластеры1С</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИнформационныеБазы</name>
  </enumValues>
  <enumValues>
    <name>ГруппаРабочиеСерверы1С</name>
  </enumValues>
  <enumValues>
    <name>ГруппаБазовыеКонтрольныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>ГруппаПубликации</name>
  </enumValues>
  <enumValues>
    <name>ГруппаСУБД</name>
  </enumValues>
  <enumValues>
    <name>ГруппаВебСерверы</name>
  </enumValues>
  <enumValues>
    <name>ГруппаТерминальныеСервера</name>
  </enumValues>
  <enumValues>
    <name>ГруппаШлюзы</name>
  </enumValues>
  <enumValues>
    <name>ГруппаВиртуальныеМашины</name>
  </enumValues>
  <enumValues>
    <name>ГруппаРасширенныеКонтрольныеПроцедуры</name>
  </enumValues>
  <enumValues>
    <name>ГруппаИнформационныеБазыКластера1С</name>
  </enumValues>
  <enumValues>
    <name>ГруппаРабочиеСерверыКластера1С</name>
  </enumValues>
  <enumValues>
    <name>MSSQL</name>
  </enumValues>
  <enumValues>
    <name>PostgreSQL</name>
  </enumValues>
  <enumValues>
    <name>VMware</name>
  </enumValues>
  <enumValues>
    <name>АнализВызововКластера1С</name>
  </enumValues>
  <enumValues>
    <name>ВебСерверApache</name>
  </enumValues>
  <enumValues>
    <name>ВебСерверIIS</name>
  </enumValues>
  <enumValues>
    <name>ГруппаАнализВызововКластера1С</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтрольНагрузочныхТестов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтрольПодключений</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтрольПотребленияПамяти</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтрольПроизводительности</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтрольРегламентныхЗаданий</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКонтрольУстойчивости</name>
  </enumValues>
  <enumValues>
    <name>ГруппаМониторингСистемныхОшибок</name>
  </enumValues>
  <enumValues>
    <name>ГруппаОценкаПользователей</name>
  </enumValues>
  <enumValues>
    <name>ИнформационнаяБаза</name>
  </enumValues>
  <enumValues>
    <name>Кластер1С</name>
  </enumValues>
  <enumValues>
    <name>КонтрольНагрузочныхТестов</name>
  </enumValues>
  <enumValues>
    <name>КонтрольПодключений</name>
  </enumValues>
  <enumValues>
    <name>КонтрольПотребленияПамяти</name>
  </enumValues>
  <enumValues>
    <name>КонтрольПроизводительности</name>
  </enumValues>
  <enumValues>
    <name>КонтрольРегламентныхЗаданий</name>
  </enumValues>
  <enumValues>
    <name>КонтрольУстойчивости</name>
  </enumValues>
  <enumValues>
    <name>МониторингСистемныхОшибок</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОценкаПользователей</name>
  </enumValues>
  <enumValues>
    <name>Публикация</name>
  </enumValues>
  <enumValues>
    <name>РабочийСервер1С</name>
  </enumValues>
  <enumValues>
    <name>РабочийСерверКластера1С</name>
  </enumValues>
  <enumValues>
    <name>ТерминальныйСервер</name>
  </enumValues>
  <enumValues>
    <name>Шлюз</name>
  </enumValues>
  <enumValues>
    <name>Корзина</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Публикации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределеннныеПроцедуры

Процедура ПередЗаписью(Отказ)
    
    Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
        УникальныйИдентификаторСтрока = Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор());
    Иначе
        ЭтотОбъект.УстановитьСсылкуНового(Справочники.Публикации.ПолучитьСсылку());
        УникальныйИдентификаторСтрока = Строка(ЭтотОбъект.ПолучитьСсылкуНового().УникальныйИдентификатор());
    КонецЕсли;
    
    // Тип инцидента "Публикация"
    ХешТипа = Справочники.ТипыИнцидентов.ХешТипИнцидента("Публикация");
    ТипИнцидента = Справочники.ТипыИнцидентов.СоздатьЭлементПоХешу(ХешТипа, "Публикация", Перечисления.УровниИнцидентов.Ошибка);
      
    // Инцидент
    ДанныеХеша = "Публикация/" + УникальныйИдентификаторСтрока;
    Хеш = Справочники.Инциденты.ХешИнцидента(ДанныеХеша);
    Инцидент = Справочники.Инциденты.СоздатьЭлементПоХешу(Хеш, "Публикация/" + Наименование);
    ИнцидентыСервер.СоздатьИнцидентыИсточника(ТипИнцидента, Инцидент); 
    
    // Тип инцидента "НедоступностьНетДанных"
    ХешТипа = Справочники.ТипыИнцидентов.ХешТипИнцидента("НедоступностьНетДанных");
    ТипИнцидента = Справочники.ТипыИнцидентов.СоздатьЭлементПоХешу(ХешТипа, "НедоступностьНетДанных", Перечисления.УровниИнцидентов.Предупреждение);
    
    // Инцидент
    ДанныеХеша = "НедоступностьНетДанных/" + УникальныйИдентификаторСтрока;
    Хеш = Справочники.Инциденты.ХешИнцидента(ДанныеХеша);
    Инцидент = Справочники.Инциденты.СоздатьЭлементПоХешу(Хеш, "НедоступностьНетДанных/" + Наименование);
    ИнцидентыСервер.СоздатьИнцидентыИсточника(ТипИнцидента, Инцидент);
   
    Если ДополнительныеСвойства.Свойство("НеПроверять") И ДополнительныеСвойства.НеПроверять Тогда
        Возврат;
    КонецЕсли;
    
    Корзина = Справочники.ПлощадкиЭксплуатации.Корзина();
    
    ЭтотОбъект.ДополнительныеСвойства.Вставить("СсылкаПлощадкаЭксплуатации", Ссылка.ПлощадкаЭксплуатации);
    ЭтотОбъект.ДополнительныеСвойства.Вставить("Корзина", Корзина);
    
    
    Если ЭтотОбъект.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
        
        ЭтотОбъект.ПлощадкаДляВосстановления = ЭтотОбъект.ПлощадкаЭксплуатации;
        ЭтотОбъект.ПлощадкаЭксплуатации = Корзина;
        
    ИначеЕсли НЕ ЭтотОбъект.ПометкаУдаления И ЭтотОбъект.ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
        
        Если ЗначениеЗаполнено(ЭтотОбъект.ПлощадкаДляВосстановления) Тогда
            ЭтотОбъект.ПлощадкаЭксплуатации = ЭтотОбъект.ПлощадкаДляВосстановления;
            ЭтотОбъект.ПлощадкаДляВосстановления = Справочники.ПлощадкиЭксплуатации.ПустаяСсылка();
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    Если ДополнительныеСвойства.Свойство("НеПроверять") И ДополнительныеСвойства.НеПроверять Тогда
        Возврат;
    КонецЕсли;
    
    СсылкаПлощадкаЭксплуатации = ЭтотОбъект.ДополнительныеСвойства.СсылкаПлощадкаЭксплуатации;
    Корзина = ЭтотОбъект.ДополнительныеСвойства.Корзина;
        
    // Это новый элемент или площадка эксплуатации не менялась
    Если НЕ ЗначениеЗаполнено(СсылкаПлощадкаЭксплуатации) ИЛИ СсылкаПлощадкаЭксплуатации = ЭтотОбъект.ПлощадкаЭксплуатации Тогда
        
        ДобавитьВПлощадку(ЭтотОбъект.ПлощадкаЭксплуатации);
                
    //  Изменилась площадка у существующего элемента          
    ИначеЕсли ЗначениеЗаполнено(СсылкаПлощадкаЭксплуатации) И СсылкаПлощадкаЭксплуатации <> ЭтотОбъект.ПлощадкаЭксплуатации Тогда
        
        ПеренестиВПлощадку(ЭтотОбъект.ПлощадкаЭксплуатации, СсылкаПлощадкаЭксплуатации);
            
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВПлощадку(ПлощадкаДобавить)
    
    ТипГруппы = Перечисления.ТипЭлементаПлощадки.ГруппаПубликации;
    ТипЭлемента = Перечисления.ТипЭлементаПлощадки.Публикация;    
    ТипыПлощадки = Новый Структура("ТипГруппы, ТипЭлемента", ТипГруппы, ТипЭлемента);
        
    Справочники.ПлощадкиЭксплуатации.ДобавитьВПлощадку(ПлощадкаДобавить, Ссылка, ТипыПлощадки.ТипГруппы, ТипыПлощадки.ТипЭлемента);

КонецПроцедуры

Процедура ПеренестиВПлощадку(ПлощадкаЭксплуатацииВ, ПлощадкаЭксплуатацииИз)
    
    ТипГруппы = Перечисления.ТипЭлементаПлощадки.ГруппаПубликации;
    ТипЭлемента = Перечисления.ТипЭлементаПлощадки.Публикация;    
    ТипыПлощадки = Новый Структура("ТипГруппы, ТипЭлемента", ТипГруппы, ТипЭлемента);
    
    Справочники.ПлощадкиЭксплуатации.ПеренестиВНовуюПлощадку(ЭтотОбъект.Ссылка, ПлощадкаЭксплуатацииВ, ПлощадкаЭксплуатацииИз, ТипыПлощадки.ТипГруппы, ТипыПлощадки.ТипЭлемента);      
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
